app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('test', 'test@example.com', '2019-01-13 04:09:26', '2019-01-13 04:09:26')
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE `users` SET `email` = 'hoge@example.com', `updated_at` = '2019-01-13 04:09:57' WHERE `users`.`id` = 1
---
  def update
    if @user.update_attributes(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    User.find(params[:id]).destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def correct_user
      @user = User.find(params[:id])